Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# settings.sidebar.rightMaxWidth.subtitleOn
source: The Dock can grow past the built-in width cap while preserving terminal space.
ar: يمكن للـ Dock أن يتجاوز حد العرض المضمن مع الحفاظ على مساحة للطرفية.
bs: Dock se može proširiti preko ugrađenog ograničenja širine uz očuvanje prostora za terminal.
da: Docken kan vokse forbi den indbyggede breddegrænse, mens der stadig reserveres plads til terminalen.
de: Das Dock kann über die integrierte Breitenbegrenzung hinaus wachsen, während Platz für das Terminal erhalten bleibt.
es: El Dock puede superar el límite de ancho integrado sin dejar de reservar espacio para la terminal.
fr: Le Dock peut dépasser la limite de largeur intégrée tout en réservant de l’espace au terminal.
it: Il Dock può superare il limite di larghezza integrato mantenendo spazio per il terminale.
ja: Dock は端末用の空間を確保したまま、組み込みの幅上限を超えて広げられます。
ko: Dock은 터미널 공간을 유지하면서 내장 너비 상한을 넘어 커질 수 있습니다.
nb: Docken kan vokse forbi den innebygde breddegrensen samtidig som terminalplass beholdes.
pl: Dock może przekroczyć wbudowany limit szerokości, zachowując miejsce dla terminala.
pt_br: O Dock pode crescer além do limite de largura integrado enquanto preserva espaço para o terminal.
ru: Dock может превышать встроенное ограничение ширины, сохраняя место для терминала.
th: Dock สามารถขยายเกินขีดจำกัดความกว้างในตัว โดยยังคงเว้นพื้นที่ให้เทอร์มินัล
tr: Dock, terminal alanını korurken yerleşik genişlik sınırını aşarak büyüyebilir.
uk: Dock може перевищувати вбудоване обмеження ширини, зберігаючи місце для термінала.
zh_hans: Dock 可以在保留终端空间的同时超过内置宽度上限。
zh_hant: Dock 可以在保留終端空間的同時超過內建寬度上限。

# settings.sidebar.rightMaxWidth.toggle
source: Use custom Dock max width
ar: استخدام عرض Dock أقصى مخصص
bs: Koristi prilagođenu maksimalnu širinu Docka
da: Brug brugerdefineret maks. Dock-bredde
de: Eigene maximale Dock-Breite verwenden
es: Usar ancho máximo personalizado del Dock
fr: Utiliser une largeur maximale personnalisée du Dock
it: Usa larghezza massima personalizzata del Dock
ja: Dock の最大幅をカスタム設定
ko: 사용자 지정 Dock 최대 너비 사용
nb: Bruk egendefinert maks bredde for Dock
pl: Użyj niestandardowej maksymalnej szerokości Docka
pt_br: Usar largura máxima personalizada do Dock
ru: Использовать пользовательскую максимальную ширину Dock
th: ใช้ความกว้างสูงสุดของ Dock แบบกำหนดเอง
tr: Özel Dock en fazla genişliğini kullan
uk: Використовувати власну максимальну ширину Dock
zh_hans: 使用自定义 Dock 最大宽度
zh_hant: 使用自訂 Dock 最大寬度

# settings.sidebar.rightTabs
source: Right Sidebar Tabs
ar: علامات تبويب الشريط الجانبي الأيمن
de: Tabs der rechten Seitenleiste
es: Pestañas de la barra lateral derecha
fr: Onglets de la barre latérale droite
ja: 右サイドバーのタブ
ko: 오른쪽 사이드바 탭
zh_hans: 右侧边栏标签页
zh_hant: 右側側邊欄標籤頁

# settings.sidebar.rightTabs.moveDown
source: Move %@ Down
ar: نقل %@ لأسفل
de: %@ nach unten verschieben
es: Mover %@ hacia abajo
fr: Déplacer %@ vers le bas
ja: %@を下に移動
ko: %@ 아래로 이동
zh_hans: 将 %@ 下移
zh_hant: 將 %@ 下移

# settings.sidebar.rightTabs.moveUp
source: Move %@ Up
ar: نقل %@ لأعلى
de: %@ nach oben verschieben
es: Mover %@ hacia arriba
fr: Déplacer %@ vers le haut
ja: %@を上に移動
ko: %@ 위로 이동
zh_hans: 将 %@ 上移
zh_hant: 將 %@ 上移

# settings.sidebar.rightTabs.subtitle
source: Choose which tabs the right sidebar shows and their order. The ⌃1–⌃9 shortcuts follow the visible order.
ar: اختر علامات التبويب التي يعرضها الشريط الجانبي الأيمن وترتيبها. تتبع اختصارات ⌃1–⌃9 الترتيب المرئي.
de: Wählen Sie aus, welche Tabs in der rechten Seitenleiste angezeigt werden und in welcher Reihenfolge. Die Tastaturkürzel ⌃1–⌃9 folgen der sichtbaren Reihenfolge.
es: Elige qué pestañas muestra la barra lateral derecha y su orden. Los atajos ⌃1–⌃9 siguen el orden visible.
fr: Choisissez les onglets affichés par la barre latérale droite et leur ordre. Les raccourcis ⌃1–⌃9 suivent l’ordre visible.
ja: 右サイドバーに表示するタブとその順序を選択します。⌃1〜⌃9 のショートカットは表示順に従います。
ko: 오른쪽 사이드바가 표시할 탭과 순서를 선택합니다. ⌃1–⌃9 단축키는 표시되는 순서를 따릅니다.
zh_hans: 选择右侧边栏显示哪些标签页及其顺序。⌃1–⌃9 快捷键按可见顺序对应。
zh_hant: 選擇右側側邊欄顯示哪些標籤頁及其順序。⌃1–⌃9 快速鍵將依循顯示的順序。

# settings.sidebarAppearance.defaultLabel
source: Default
ar: افتراضي
bs: Zadano
da: Standard
de: Standard
es: Predeterminado
fr: Par défaut
it: Predefinito
ja: デフォルト
ko: 기본값
nb: Standard
pl: Domyślny
pt_br: Padrão
ru: По умолчанию
th: ค่าเริ่มต้น
tr: Varsayılan
uk: Стандартний
zh_hans: 默认
zh_hant: 預設

# settings.sidebarAppearance.fontSize
source: Sidebar Font Size
ar: حجم خط الشريط الجانبي
de: Schriftgröße der Seitenleiste
es: Tamaño de fuente de la barra lateral
fr: Taille de police de la barre latérale
ja: サイドバーのフォントサイズ
ko: 사이드바 글꼴 크기
zh_hans: 侧边栏字号
zh_hant: 側邊欄字型大小

# settings.sidebarAppearance.fontSize.reset
source: Reset
ar: إعادة تعيين
de: Zurücksetzen
es: Restablecer
fr: Réinitialiser
ja: リセット
ko: 재설정
zh_hans: 重置
zh_hant: 重置

# settings.sidebarAppearance.fontSize.saveFailed
source: Couldn't save sidebar font size. Please try again.
ar: تعذر حفظ حجم خط الشريط الجانبي. يرجى المحاولة مرة أخرى.
de: Schriftgröße der Seitenleiste konnte nicht gespeichert werden. Bitte versuchen Sie es erneut.
es: No se pudo guardar el tamaño de fuente de la barra lateral. Inténtalo de nuevo.
fr: Impossible d’enregistrer la taille de la police de la barre latérale. Veuillez réessayer.
ja: サイドバーのフォントサイズを保存できませんでした。もう一度お試しください。
ko: 사이드바 글꼴 크기를 저장할 수 없습니다. 다시 시도해 주세요.
zh_hans: 无法保存侧边栏字号。请重试。
zh_hant: 無法儲存側邊欄字型大小。請再試一次。

# settings.sidebarAppearance.fontSize.subtitle
source: Controls workspace titles, metadata, badges, and shortcut hints in the left sidebar.
ar: يتحكم في عناوين مساحات العمل، والبيانات الوصفية، والشارات، وتلميحات الاختصارات في الشريط الجانبي الأيسر.
de: Steuert Arbeitsbereichstitel, Metadaten, Badges und Tastaturkürzel-Hinweise in der linken Seitenleiste.
es: Controla los títulos de espacio de trabajo, metadatos, insignias y sugerencias de atajos en la barra lateral izquierda.
fr: Contrôle les titres d’espace de travail, les métadonnées, les badges et les indices de raccourcis dans la barre latérale gauche.
ja: 左サイドバーのワークスペースタイトル、メタデータ、バッジ、ショートカットヒントのサイズを調整します。
ko: 왼쪽 사이드바의 작업 공간 제목, 메타데이터, 배지 및 단축키 힌트를 조절합니다.
zh_hans: 控制左侧边栏中的工作区标题、元数据、角标和快捷键提示。
zh_hant: 控制左側側邊欄中的工作區標題、中繼資料、徽章與快速鍵提示。

# settings.sidebarAppearance.matchTerminalBackground
source: Match Terminal Background
ar: مطابقة خلفية الطرفية
de: An Terminal-Hintergrund anpassen
es: Coincidir con el fondo de la terminal
fr: Faire correspondre à l'arrière-plan du terminal
ja: ターミナルの背景に合わせる
ko: 터미널 배경과 일치
zh_hans: 匹配终端背景
zh_hant: 符合終端機背景

# settings.sidebarAppearance.matchTerminalBackground.subtitle
source: Use the same background color and transparency as the terminal.
ar: استخدام نفس لون الخلفية والشفافية للطرفية.
de: Verwenden Sie dieselbe Hintergrundfarbe und Transparenz wie das Terminal.
es: Usa el mismo color de fondo y transparencia que la terminal.
fr: Utiliser la même couleur d’arrière-plan et la même transparence que le terminal.
ja: ターミナルと同じ背景色と透明度を使用します。
ko: 터미널과 동일한 배경색 및 투명도를 사용합니다.
zh_hans: 使用与终端相同的背景颜色和透明度。
zh_hant: 使用與終端機相同的背景顏色與透明度。

# settings.sidebarAppearance.reset
source: Reset Sidebar Tint
ar: إعادة تعيين لون الشريط الجانبي
bs: Resetuj nijansu bočne trake
da: Nulstil sidebjælkens farvetone
de: Seitenleisten-Farbton zurücksetzen
es: Restablecer tinte de la barra lateral
fr: Réinitialiser la teinte de la barre latérale
it: Ripristina tinta barra laterale
ja: サイドバーのティントをリセット
ko: 사이드바 색조 초기화
nb: Tilbakestill sidefelts fargetone
pl: Resetuj odcień paska bocznego
pt_br: Redefinir Tonalidade da Barra Lateral
ru: Сбросить оттенок боковой панели
th: รีเซ็ตโทนสีแถบด้านข้าง
tr: Kenar Çubuğu Renk Tonunu Sıfırla
uk: Скинути відтінок бічної панелі
zh_hans: 重置侧边栏色调
zh_hant: 重置側邊欄色調

# settings.sidebarAppearance.reset.button
source: Reset
ar: إعادة تعيين
bs: Resetuj
da: Nulstil
de: Zurücksetzen
es: Restablecer
fr: Réinitialiser
it: Ripristina
ja: リセット
ko: 초기화
nb: Tilbakestill
pl: Resetuj
pt_br: Redefinir
ru: Сбросить
th: รีเซ็ต
tr: Sıfırla
uk: Скинути
zh_hans: 重置
zh_hant: 重置

# settings.sidebarAppearance.reset.subtitle
source: Restore default sidebar appearance.
ar: استعادة مظهر الشريط الجانبي الافتراضي.
bs: Vrati zadani izgled bočne trake.
da: Gendan standardudseendet for sidebjælken.
de: Standard-Seitenleisten-Erscheinungsbild wiederherstellen.
es: Restaurar la apariencia predeterminada de la barra lateral.
fr: Restaurer l'apparence par défaut de la barre latérale.
it: Ripristina l'aspetto predefinito della barra laterale.
ja: サイドバーの外観をデフォルトに戻す。
ko: 사이드바 모양을 기본값으로 복원합니다.
nb: Gjenopprett standard sidefelts utseende.
pl: Przywróć domyślny wygląd paska bocznego.
pt_br: Restaurar aparência padrão da barra lateral.
ru: Восстановить внешний вид боковой панели по умолчанию.
th: คืนค่ารูปลักษณ์แถบด้านข้างเป็นค่าเริ่มต้น
tr: Varsayılan kenar çubuğu görünümünü geri yükle.
uk: Відновити стандартний зовнішній вигляд бічної панелі.
zh_hans: 恢复默认侧边栏外观。
zh_hant: 恢復預設側邊欄外觀。

# settings.sidebarAppearance.tintColorDark
source: Dark Mode Tint
ar: لون الوضع الداكن
bs: Nijansa tamnog načina
da: Mørk tilstand farvetone
de: Farbton im dunklen Modus
es: Tinte del modo oscuro
fr: Teinte du mode sombre
it: Tinta modalità scura
ja: ダークモードのティント
ko: 다크 모드 색조
nb: Fargetone for mørk modus
pl: Odcień trybu ciemnego
pt_br: Tonalidade do Modo Escuro
ru: Оттенок тёмного режима
th: โทนสีโหมดมืด
tr: Koyu Mod Renk Tonu
uk: Відтінок для темного режиму
zh_hans: 深色模式色调
zh_hant: 深色模式色調

# settings.sidebarAppearance.tintColorDark.picker
source: Dark tint
ar: لون داكن
bs: Tamna nijansa
da: Mørk farvetone
de: Dunkler Farbton
es: Tinte oscuro
fr: Teinte sombre
it: Tinta scura
ja: ダークティント
ko: 다크 색조
nb: Mørk fargetone
pl: Ciemny odcień
pt_br: Tonalidade escura
ru: Тёмный оттенок
th: โทนมืด
tr: Koyu ton
uk: Темний відтінок
zh_hans: 深色色调
zh_hant: 深色色調

# settings.sidebarAppearance.tintColorDark.subtitle
source: Sidebar tint color when using dark appearance.
ar: لون تلوين الشريط الجانبي عند استخدام المظهر الداكن.
bs: Boja nijanse bočne trake pri tamnom izgledu.
da: Sidebjælkens farvetone ved mørkt udseende.
de: Seitenleisten-Farbton bei dunklem Erscheinungsbild.
es: Color de tinte de la barra lateral en apariencia oscura.
fr: Couleur de teinte de la barre latérale en apparence sombre.
it: Colore tinta della barra laterale in modalità scura.
ja: ダーク表示時のサイドバーのティントカラー。
ko: 다크 모양 사용 시 사이드바 색조 색상.
nb: Fargetone for sidefeltet med mørkt utseende.
pl: Kolor odcienia paska bocznego w ciemnym wyglądzie.
pt_br: Cor de tonalidade da barra lateral na aparência escura.
ru: Цвет оттенка боковой панели в тёмном режиме.
th: สีโทนของแถบด้านข้างเมื่อใช้รูปลักษณ์มืด
tr: Koyu görünüm kullanılırken kenar çubuğu renk tonu.
uk: Колір відтінку бічної панелі при темному зовнішньому вигляді.
zh_hans: 使用深色外观时侧边栏的色调颜色。
zh_hant: 使用深色外觀時側邊欄的色調顏色。

# settings.sidebarAppearance.tintColorLight
source: Light Mode Tint
ar: لون الوضع الفاتح
bs: Nijansa svijetlog načina
da: Lys tilstand farvetone
de: Farbton im hellen Modus
es: Tinte del modo claro
fr: Teinte du mode clair
it: Tinta modalità chiara
ja: ライトモードのティント
ko: 라이트 모드 색조
nb: Fargetone for lys modus
pl: Odcień trybu jasnego
pt_br: Tonalidade do Modo Claro
ru: Оттенок светлого режима
th: โทนสีโหมดสว่าง
tr: Açık Mod Renk Tonu
uk: Відтінок для світлого режиму
zh_hans: 浅色模式色调
zh_hant: 淺色模式色調

# settings.sidebarAppearance.tintColorLight.picker
source: Light tint
ar: لون فاتح
bs: Svijetla nijansa
da: Lys farvetone
de: Heller Farbton
es: Tinte claro
fr: Teinte claire
it: Tinta chiara
ja: ライトティント
ko: 라이트 색조
nb: Lys fargetone
pl: Jasny odcień
pt_br: Tonalidade clara
ru: Светлый оттенок
th: โทนสว่าง
tr: Açık ton
uk: Світлий відтінок
zh_hans: 浅色色调
zh_hant: 淺色色調

# settings.sidebarAppearance.tintColorLight.subtitle
source: Sidebar tint color when using light appearance.
ar: لون تلوين الشريط الجانبي عند استخدام المظهر الفاتح.
bs: Boja nijanse bočne trake pri svijetlom izgledu.
da: Sidebjælkens farvetone ved lyst udseende.
de: Seitenleisten-Farbton bei hellem Erscheinungsbild.
es: Color de tinte de la barra lateral en apariencia clara.
fr: Couleur de teinte de la barre latérale en apparence claire.
it: Colore tinta della barra laterale in modalità chiara.
ja: ライト表示時のサイドバーのティントカラー。
ko: 라이트 모양 사용 시 사이드바 색조 색상.
nb: Fargetone for sidefeltet med lyst utseende.
pl: Kolor odcienia paska bocznego w jasnym wyglądzie.
pt_br: Cor de tonalidade da barra lateral na aparência clara.
ru: Цвет оттенка боковой панели в светлом режиме.
th: สีโทนของแถบด้านข้างเมื่อใช้รูปลักษณ์สว่าง
tr: Açık görünüm kullanılırken kenar çubuğu renk tonu.
uk: Колір відтінку бічної панелі при світлому зовнішньому вигляді.
zh_hans: 使用浅色外观时侧边栏的色调颜色。
zh_hant: 使用淺色外觀時側邊欄的色調顏色。

# settings.sidebarAppearance.tintOpacity
source: Tint Opacity
ar: شفافية اللون
bs: Prozirnost nijanse
da: Farvetone gennemsigtighed
de: Farbton-Deckkraft
es: Opacidad del tinte
fr: Opacité de la teinte
it: Opacità tinta
ja: ティントの不透明度
ko: 색조 불투명도
nb: Fargetone-opasitet
pl: Krycie odcienia
pt_br: Opacidade da Tonalidade
ru: Непрозрачность оттенка
th: ความทึบของโทนสี
tr: Renk Tonu Opaklığı
uk: Непрозорість відтінку
zh_hans: 色调不透明度
zh_hant: 色調不透明度

# settings.sidebarAppearance.tintOpacity.subtitle
source: How strongly the tint color shows over the sidebar material.
ar: مدى قوة ظهور لون التلوين فوق مادة الشريط الجانبي.
bs: Koliko jako se boja nijanse prikazuje preko materijala bočne trake.
da: Hvor stærkt farvetonen vises over sidebjælkens materiale.
de: Wie stark der Farbton über dem Seitenleisten-Material sichtbar ist.
es: Intensidad del color de tinte sobre el material de la barra lateral.
fr: Intensité de la teinte sur le matériau de la barre latérale.
it: Intensità della tinta sul materiale della barra laterale.
ja: サイドバーの素材上にティントカラーがどの程度表示されるか。
ko: 사이드바 재질 위에 색조 색상이 표시되는 강도.
nb: Hvor sterkt fargetonen vises over sidefelts materiale.
pl: Jak silnie kolor odcienia jest widoczny na materiale paska bocznego.
pt_br: Intensidade da cor de tonalidade sobre o material da barra lateral.
ru: Насколько сильно оттенок виден на материале боковой панели.
th: ความเข้มของสีโทนที่แสดงบนวัสดุแถบด้านข้าง
tr: Renk tonunun kenar çubuğu materyali üzerinde ne kadar güçlü göründüğü.
uk: Наскільки сильно колір відтінку проявляється поверх матеріалу бічної панелі.
zh_hans: 色调颜色在侧边栏材质上的显示强度。
zh_hant: 色調顏色在側邊欄材質上的顯示強度。

# settings.state.active
source: Active
ar: نشط
bs: Aktivno
da: Aktiv
de: Aktiv
es: Activo
fr: Actif
it: Attivo
ja: アクティブ
ko: 활성
nb: Aktiv
pl: Aktywny
pt_br: Ativo
ru: Активное
th: ใช้งานอยู่
tr: Etkin
uk: Активний
zh_hans: 活跃
zh_hant: 使用中

# settings.state.followWindow
source: Follow Window
ar: متابعة النافذة
bs: Prati prozor
da: Følg vindue
de: Fenster folgen
es: Seguir ventana
fr: Suivre la fenêtre
it: Segui finestra
ja: ウインドウに追従
ko: 윈도우 따르기
nb: Følg vindu
pl: Podążaj za oknem
pt_br: Seguir Janela
ru: Следовать за окном
th: ตามหน้าต่าง
tr: Pencereyi Takip Et
uk: Відповідно до вікна
zh_hans: 跟随窗口
zh_hant: 跟隨視窗

# settings.state.inactive
source: Inactive
ar: غير نشط
bs: Neaktivno
da: Inaktiv
de: Inaktiv
es: Inactivo
fr: Inactif
it: Inattivo
ja: 非アクティブ
ko: 비활성
nb: Inaktiv
pl: Nieaktywny
pt_br: Inativo
ru: Неактивное
th: ไม่ได้ใช้งาน
tr: Etkin Değil
uk: Неактивний
zh_hans: 不活跃
zh_hant: 非使用中

# settings.terminal.adaptiveDefaultTheme
source: Adapt Default Theme to Appearance
ar: تكييف السمة الافتراضية مع المظهر
de: Standard-Theme an das Erscheinungsbild anpassen
es: Adaptar el tema predeterminado a la apariencia
fr: Adapter le thème par défaut à l’apparence
ja: デフォルトテーマを外観に合わせる
ko: 외양에 맞춰 기본 테마 조정
zh_hans: 让默认主题跟随外观
zh_hant: 依外觀調整預設主題

# settings.terminal.adaptiveDefaultTheme.subtitleOff
source: An untouched Ghostty config uses Ghostty's fixed built-in palette. Existing Ghostty settings, including light/dark theme pairs, are always preserved.
ar: يستخدم تكوين Ghostty غير المعدل لوحة الألوان المدمجة الثابتة لـ Ghostty. يتم دائمًا حفظ إعدادات Ghostty الحالية، بما في ذلك أزواج السمات الفاتحة والداكنة.
de: Eine unberührte Ghostty-Konfiguration verwendet die feste, integrierte Palette von Ghostty. Bestehende Ghostty-Einstellungen, einschließlich hell/dunkel-Theme-Paaren, bleiben immer erhalten.
es: Una configuración de Ghostty intacta usa la paleta integrada fija de Ghostty. Los ajustes existentes de Ghostty, incluidos los pares de temas claro/oscuro, siempre se conservan.
fr: Une configuration Ghostty intacte utilise la palette fixe intégrée de Ghostty. Les paramètres Ghostty existants, y compris les paires de thèmes clair/sombre, sont toujours préservés.
ja: Ghostty 設定が空の場合は、固定された組み込みパレットを使用します。ライト／ダークのテーマペアを含む既存の Ghostty 設定は常に保持します。
ko: 수정되지 않은 Ghostty 설정은 Ghostty의 고정된 기본 팔레트를 사용합니다. 라이트/다크 테마 쌍을 포함한 기존 Ghostty 설정은 항상 유지됩니다.
zh_hans: 未改动过的 Ghostty 配置会使用 Ghostty 固定的内置调色板。已有的 Ghostty 设置（包括浅色/深色主题配对）始终会被保留。
zh_hant: 未修改的 Ghostty 設定檔將使用 Ghostty 固定的內建調色盤。現有的 Ghostty 設定（包括淺色/深色主題配對）會始終保留。

# settings.terminal.adaptiveDefaultTheme.subtitleOn
source: cmux's managed light and dark palettes follow the app appearance only when your Ghostty config has no settings. Existing Ghostty settings are never overlaid.
ar: تتبع لوحات الألوان الفاتحة والداكنة المدارة لـ cmux مظهر التطبيق فقط عندما لا يحتوي تكوين Ghostty على إعدادات. لا يتم تداخل إعدادات Ghostty الحالية مطلقًا.
de: Die von cmux verwalteten hellen und dunklen Paletten folgen dem Erscheinungsbild der App nur dann, wenn Ihre Ghostty-Konfiguration keine Einstellungen enthält. Bestehende Ghostty-Einstellungen werden niemals überschrieben.
es: Las paletas clara y oscura administradas de cmux siguen la apariencia de la aplicación solo cuando tu configuración de Ghostty no tiene ajustes. Los ajustes existentes de Ghostty nunca se sobrescriben.
fr: Les palettes claire et sombre gérées de cmux suivent l’apparence de l’application uniquement si votre configuration Ghostty ne contient aucun paramètre. Les paramètres Ghostty existants ne sont jamais écrasés.
ja: Ghostty 設定が空の場合のみ、cmux の管理するライト／ダークパレットがアプリの外観に追従します。既存の Ghostty 設定には重ねて適用しません。
ko: Ghostty 설정에 아무런 설정이 없는 경우에만 cmux가 관리하는 라이트 및 다크 팔레트가 앱 외양을 따릅니다. 기존 Ghostty 설정은 절대로 덮어씌워지지 않습니다.
zh_hans: 仅当你的 Ghostty 配置没有任何设置时，cmux 托管的浅色与深色调色板才会跟随应用外观。已有的 Ghostty 设置永远不会被覆盖。
zh_hant: 僅在您的 Ghostty 設定檔中沒有任何設定時，cmux 管理的淺色與深色調色盤才會隨軟體外觀變更。現有的 Ghostty 設定絕不會被覆蓋。

# settings.terminal.agentAutoResume
source: Resume Agent Sessions on Reopen
ar: استئناف جلسات الوكيل عند إعادة الفتح
de: Agenten-Sitzungen beim erneuten Öffnen fortsetzen
es: Reanudar sesiones de agentes al volver a abrir
fr: Reprendre les sessions d'agent à la réouverture
ja: 再起動時にエージェントセッションを再開
ko: 재열기 시 에이전트 세션 재개
zh_hans: 重新打开时恢复代理会话
zh_hant: 重新開啟時恢復代理工作階段

# settings.terminal.agentAutoResume.subtitleOff
source: When cmux reopens after quit, restored agent terminals stay idle until you resume them manually.
ar: عند إعادة فتح cmux بعد الإنهاء، تظل طرفيات الوكلاء المستعادة خاملة حتى تقوم باستئنافها يدويًا.
de: Wenn cmux nach dem Beenden wieder geöffnet wird, bleiben wiederhergestellte Agenten-Terminals im Leerlauf, bis Sie sie manuell fortsetzen.
es: Cuando cmux se vuelve a abrir después de salir, las terminales de agentes restauradas permanecen inactivas hasta que las reanudes manualmente.
fr: Lorsque cmux se rouvre après avoir été quitté, les terminaux d’agent restaurés restent inactifs jusqu’à ce que vous les repreniez manuellement.
ja: cmux を終了後に再度開いたとき、復元されたエージェント端末は手動で再開するまで待機します。
ko: 종료 후 cmux를 다시 열었을 때, 복원된 에이전트 터미널은 사용자가 수동으로 재개할 때까지 대기 상태로 유지됩니다.
zh_hans: cmux 退出后重新打开时，已恢复的代理终端保持空闲，直到手动恢复它们。
zh_hant: 當結束後重新開啟 cmux 時，還原的代理終端機會保持閒置，直到您手動恢復為止。

# settings.terminal.agentAutoResume.subtitleOn
source: When cmux reopens after quit, restored agent terminals automatically run their resume command.
ar: عند إعادة فتح cmux بعد الإنهاء، تقوم طرفيات الوكلاء المستعادة بتشغيل أمر الاستئناف الخاص بها تلقائيًا.
de: Wenn cmux nach dem Beenden wieder geöffnet wird, führen wiederhergestellte Agenten-Terminals automatisch ihren Fortsetzungsbefehl aus.
es: Cuando cmux se vuelve a abrir después de salir, las terminales de agentes restauradas ejecutan automáticamente su comando de reanudación.
fr: Lorsque cmux se rouvre après avoir été quitté, les terminaux d’agent restaurés exécutent automatiquement leur commande de reprise.
ja: cmux を終了後に再度開いたとき、復元されたエージェント端末で再開コマンドを自動実行します。
ko: 종료 후 cmux를 다시 열었을 때, 복원된 에이전트 터미널이 재개 명령을 자동으로 실행합니다.
zh_hans: cmux 退出后重新打开时，已恢复的代理终端会自动运行其恢复命令。
zh_hant: 當結束後重新開啟 cmux 時，還原的代理終端機會自動執行其恢復指令。

# settings.terminal.agentHibernation
source: Agent Hibernation
ar: سبات الوكيل
de: Agenten-Ruhezustand
es: Hibernación de agentes
fr: Hibernation de l'agent
ja: エージェント休止
ko: 에이전트 최대 절전
zh_hans: 代理休眠
zh_hant: 代理休眠

# settings.terminal.agentHibernation.idleSeconds
source: Hibernate After Idle Seconds
ar: السبات بعد ثوانٍ من الخمول
de: In den Ruhezustand versetzen nach Sekunden im Leerlauf
es: Hibernar después de segundos de inactividad
fr: Hiberner après plusieurs secondes d'inactivité
ja: 休止までのアイドル秒数
ko: 유휴 시간(초) 후 최대 절전
zh_hans: 空闲多少秒后休眠
zh_hant: 閒置指定秒數後休眠

# settings.terminal.agentHibernation.idleSeconds.subtitle
source: A terminal must have no output and report an idle agent lifecycle for this long before it can be hibernated.
ar: يجب ألا تحتوي الطرفية على أي مخرجات وتُبلغ عن دورة حياة وكيل خاملة لهذه المدة قبل إدخالها في السبات.
de: Ein Terminal darf keine Ausgabe haben und muss so lange einen inaktiven Agenten-Lebenszyklus melden, bevor es in den Ruhezustand versetzt werden kann.
es: Una terminal no debe tener salida y debe reportar un ciclo de vida de agente inactivo durante este tiempo antes de poder ser hibernada.
fr: Un terminal ne doit produire aucune sortie et signaler un cycle de vie d’agent inactif pendant cette durée avant de pouvoir être hiberné.
ja: この時間だけ出力がなく、エージェントのライフサイクルがアイドルと報告された端末だけを休止できます。
ko: 터미널은 최대 절전 모드로 전환되기 전에 출력물이 없고 에이전트 라이프사이클이 이 시간 동안 유휴 상태임을 보고해야 합니다.
zh_hans: 终端必须持续这么久没有输出并报告代理生命周期为空闲，才能被休眠。
zh_hant: 終端機必須在此期間內無任何輸出，且回報代理生命週期處於閒置狀態，才能進入休眠。

# settings.terminal.agentHibernation.maxLiveTerminals
source: Max Live Agent Terminals
ar: الحد الأقصى للطرفيات النشطة للوكيل
de: Maximale Anzahl aktiver Agenten-Terminals
es: Terminales de agentes activas máximas
fr: Nombre max de terminaux d'agent actifs
ja: ライブエージェント端末の上限
ko: 최대 활성 에이전트 터미널 수
zh_hans: 最大活动代理终端数
zh_hant: 作用中代理終端機數量上限

# settings.terminal.agentHibernation.maxLiveTerminals.subtitle
source: Visible terminals stay live. Extra idle background agent terminals hibernate oldest first.
ar: تظل الطرفيات المرئية نشطة. وتدخل طرفيات الوكيل الخلفية الخاملة الإضافية في السبات، الأقدم أولاً.
de: Sichtbare Terminals bleiben aktiv. Zusätzliche im Hintergrund befindliche, inaktive Agenten-Terminals werden beginnend mit dem ältesten in den Ruhezustand versetzt.
es: Las terminales visibles permanecen activas. Las terminales de agentes inactivas adicionales en segundo plano se hibernan empezando por la más antigua.
fr: Les terminaux visibles restent actifs. Les terminaux d’agent inactifs supplémentaires en arrière-plan hibernent en commençant par les plus anciens.
ja: 表示中の端末はライブのままです。余分なアイドル中のバックグラウンドエージェント端末は古い順に休止します。
ko: 화면에 보이는 터미널은 활성 상태로 유지됩니다. 백그라운드에 있는 추가 유휴 에이전트 터미널은 오래된 순서대로 최대 절전 모드로 전환됩니다.
zh_hans: 可见的终端保持活动。多出的空闲后台代理终端按最旧优先休眠。
zh_hant: 可見的終端機會保持作用中。超出上限的閒置背景代理終端機將從最舊的開始休眠。
